---
kind: method
id: M:Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
source: html/f82bc870-072c-9780-bf35-c6fc4f798417.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadBuildingType.IsNameUnique Method

Determines whether a potential building type name is unique.

## Syntax (C#)
```csharp
public static bool IsNameUnique(
	Document document,
	string name
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.
- **name** (`System.String`) - The candidate name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null